<html><title>Sound Ruler - Manual vs. Autom&aacute;tico</title>
<body bgcolor="#FFFFFF">
<table width="100%" border="0" bgcolor="#000000" cellpadding="0" cellspacing="0">
  <tr>
    <td width="53%"><a href="index.html"><img src="final/sublgogo.gif" width="390" height="65" border="0"></a></td>
    <td width="47%">
      <div align="center"><font color="#FFFFFF"><b><font size="3" face="Arial, Helvetica, sans-serif">Manual 
        vs. Autom&aacute;tico</font></b></font></div>
    </td>
  </tr>
</table>
<p><a href="manual_auto-en.htm"><img src="final/flag-en.png" width="31" height="21" border="0"></a> 
  <a href="manual_auto-en.htm"><font face="Arial, Helvetica, sans-serif" size="1">in 
  English </font></a></p>
<p><b><font face="Arial, Helvetica, sans-serif" size="3"> Manual vs. Autom&aacute;tico 
  </font></b></p>
<p><font face="Arial, Helvetica, sans-serif" size="2">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</font><font face="Arial, Helvetica, sans-serif" size="2">An&aacute;lises 
  ac&uacute;sticas manuais (clicando o mouse e anotando) podem facilmente demandar 
  muito tempo. Al&eacute;m disso, as medi&ccedil;&otilde;es requerem a <b>categoriza&ccedil;&atilde;o</b> 
  de mudan&ccedil;as cont&iacute;nuas em amplitude (dura&ccedil;&atilde;o do canto, 
  n&uacute;mero de pulsos, n&uacute;mero de harm&ocirc;nicos). As decis&otilde;es 
  que s&atilde;o feitas para se determinar os pontos de in&iacute;cio e o fim 
  do som devem ser objetivas, consistentes e publicadas explicitamente, mas raramente 
  a an&aacute;lise &eacute; conduzida desta maneira.<br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;Medi&ccedil;&otilde;es autom&aacute;ticas podem 
  ser muito <b>r&aacute;pidas</b> e <b>objetivas</b>, com algor&iacute;timos e 
  par&acirc;metros de medi&ccedil;&atilde;o expl&iacute;citos. No entanto, sempre 
  existe o risco de uma situa&ccedil;&atilde;o ac&uacute;stica inesperada fazer 
  com que o sistema autom&aacute;tico proceda de maneira inadequada e produza 
  resultados distorcidos. <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;O Sound Ruler tenta reunir o melhor de ambas as 
  op&ccedil;&otilde;es com a <b>an&aacute;lise interativa</b>. O programa mostra 
  graficamente os resultados para cada procedimento, e o usu&aacute;rio decide 
  aceitar, pular ou ajustar cada medi&ccedil;&atilde;o. Desta forma, consegue-se 
  a <b>velocidade</b> e <b>objetividade</b> de uma an&aacute;lise autom&aacute;tica, 
  mas possibilitando a <b>elimina&ccedil;&atilde;o de situa&ccedil;&otilde;es 
  inesperadas</b> mas quais os algor&iacute;timos n&atilde;o procedem apropriadamente. 
  Um processo de itera&ccedil;&atilde;o &eacute; usado para definir os melhores 
  algor&iacute;timos e par&acirc;metros para cada an&aacute;lise. Este procedimento 
  pode ser realizado antes da an&aacute;lise, sem salvar os resultados. Uma vez 
  satisfeito com os par&acirc;metros, o usu&aacute;rio procede com a an&aacute;lise 
  sem modific&aacute;-los, para garantir a comparabilidade dos resultados. <br>
  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;O Sound Ruler pode ser usado para analisar um 
  mesmo sinal em <b>v&aacute;rios n&iacute;veis</b> de automa&ccedil;&atilde;o 
  e complexidade. &Eacute; responsabilidade do</font><font face="Arial, Helvetica, sans-serif" size="2"> 
  usu&aacute;rio decidir quais os m&eacute;todos mais apropriados para cada an&aacute;lise. 
  <br>
  </font><font face="Arial, Helvetica, sans-serif" size="2"> &nbsp;&nbsp;&nbsp;</font><font face="Arial, Helvetica, sans-serif" size="2"><br>
  </font><font face="Arial, Helvetica, sans-serif" size="1"><a href="index-br.htm">P&aacute;gina 
  Inicial</a></font></p>
<table width="100%" border="0" bgcolor="#000000">
  <tr>
    <td>&nbsp;</td>
    <td>&nbsp;</td>
  </tr>
</table>
<p>&nbsp;</p>
</html>